lkolbly/cmsis-svd/data/TexasInstruments/LM4F121H5QR.svd
        <register>
          <name>DCGCGPIO</name>
          <description>General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCGPIO_D0</name>
              <description>GPIO Port A Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D1</name>
              <description>GPIO Port B Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D2</name>
              <description>GPIO Port C Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D3</name>
              <description>GPIO Port D Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D4</name>
              <description>GPIO Port E Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D5</name>
              <description>GPIO Port F Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D6</name>
              <description>GPIO Port G Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D7</name>
              <description>0Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D8</name>
              <description>GPIO Port J Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D9</name>
              <description>GPIO Port K Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D10</name>
              <description>GPIO Port L Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D11</name>
              <description>GPIO Port M Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D12</name>
              <description>GPIO Port N Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D13</name>
              <description>GPIO Port P Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCGPIO_D14</name>
              <description>GPIO Port Q Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCDMA</name>
          <description>Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCDMA_D0</name>
              <description>uDMA Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUART_D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCSSI_D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCI2C</name>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCI2C_D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D4</name>
              <description>I2C Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D5</name>
              <description>I2C Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUSB</name>
          <description>Universal Serial Bus Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000828</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUSB_D0</name>
              <description>USB Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCAN</name>
          <description>Controller Area Network Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000834</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCCAN_D0</name>
              <description>CAN Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCCAN_D1</name>
              <description>CAN Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCADC</name>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCADC_D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCADC_D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCACMP_D0</name>
              <description>Analog Comparator Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCEEPROM_D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCWTIMER</name>
          <description>Wide Timer Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000085C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCWTIMER_D0</name>
              <description>Wide Timer 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D1</name>
              <description>Wide Timer 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D2</name>
              <description>Wide Timer 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D3</name>
              <description>Wide Timer 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D4</name>
              <description>Wide Timer 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCWTIMER_D5</name>
              <description>Wide Timer 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCWD</name>
          <description>Watchdog Timer Power Control</description>
          <addressOffset>0x00000900</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCWD_P0</name>
              <description>Watchdog Timer 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCWD_P1</name>
              <description>Watchdog Timer 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTIMER</name>
          <description>Timer Power Control</description>
          <addressOffset>0x00000904</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCTIMER_P0</name>
              <description>Timer 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P1</name>
              <description>Timer 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P2</name>
              <description>Timer 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P3</name>
              <description>Timer 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P4</name>
              <description>Timer 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P5</name>
              <description>Timer 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCGPIO</name>
          <description>General-Purpose Input/Output Power Control</description>
          <addressOffset>0x00000908</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCGPIO_P0</name>
              <description>GPIO Port A Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P1</name>
              <description>GPIO Port B Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P2</name>
              <description>GPIO Port C Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P3</name>
              <description>GPIO Port D Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P4</name>
              <description>GPIO Port E Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P5</name>
              <description>GPIO Port F Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P6</name>
              <description>GPIO Port G Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P7</name>
              <description>GPIO Port H Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P8</name>
              <description>GPIO Port J Power Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P9</name>
              <description>GPIO Port K Power Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P10</name>
              <description>GPIO Port L Power Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P11</name>
              <description>GPIO Port M Power Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P12</name>
              <description>GPIO Port N Power Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P13</name>
              <description>GPIO Port P Power Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P14</name>
              <description>GPIO Port Q Power Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDMA</name>
          <description>Micro Direct Memory Access Power Control</description>
          <addressOffset>0x0000090C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCDMA_P0</name>
              <description>uDMA Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Power Control</description>
          <addressOffset>0x00000918</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUART_P0</name>
              <description>UART Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P1</name>
              <description>UART Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P2</name>
              <description>UART Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P3</name>
              <description>UART Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P4</name>
              <description>UART Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P5</name>
              <description>UART Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P6</name>
              <description>UART Module 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P7</name>
              <description>UART Module 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSSI</name>
          <description>Synchronous Serial Interface Power Control</description>
          <addressOffset>0x0000091C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCSSI_P0</name>
              <description>SSI Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P1</name>
              <description>SSI Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P2</name>
              <description>SSI Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P3</name>
              <description>SSI Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCI2C</name>
          <description>Inter-Integrated Circuit Power Control</description>
          <addressOffset>0x00000920</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCI2C_P0</name>
              <description>I2C Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P1</name>
              <description>I2C Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P2</name>
              <description>I2C Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P3</name>
              <description>I2C Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P4</name>
              <description>I2C Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P5</name>
              <description>I2C Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCUSB</name>
          <description>Universal Serial Bus Power Control</description>
          <addressOffset>0x00000928</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUSB_P0</name>
              <description>USB Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCAN</name>
          <description>Controller Area Network Power Control</description>
          <addressOffset>0x00000934</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCCAN_P0</name>
              <description>CAN Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCCAN_P1</name>
              <description>CAN Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
